ezois_ka/oooezoiskaobmen.ИТБК_/src/DataProcessors/Автоизготовление/Автоизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Автоизготовление</name>
  <attributes>
    <name>ЗаказНаСборку</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доизготовление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладеВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ezois_ka/oooezoiskaobmen.ИТБК_/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/DataProcessors/Автоизготовление/Forms/Форма_новая/Module.bsl
&НаСервере
Перем   ЕстьСохраненныеДанные;

#Область СобытияФормы

&НаСервере
Процедура ЗаказНаСборкуПриИзмененииНаСервере()
	
	Сборка = Неопределено;
	
	Элементы.Материалы_ТаблицаГруппаДоизгтовление.ТолькоПросмотр = не ИспользуютсяСерии(объект.ЗаказНаСборку.Номенклатура);
	объект.Материалы.Очистить();
	объект.Серии.Очистить();
	Если  объект.ЗаказНаСборку.Пустая() тогда возврат КонецЕсли;
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Документы.СборкаТоваров.ПустаяСсылка(),Документы.СборкаТоваров));
	
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   СборкаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|   Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|   СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
	|   И СборкаТоваров.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЗаказНаСборку",объект.ЗаказНаСборку);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	Если  РезультатЗапроса.Количество()  тогда
		Сборка = РезультатЗапроса[0].ссылка;
		ОбщегоНазначения.СообщитьПользователю("Данный заказ был изготовлен ",РезультатЗапроса[0].Ссылка,"ЗаказНаСборку","Объект.ЗаказНаСборку",Отказ);
	КонецЕсли;
	Элементы.СоздатьСборки.Доступность = не Отказ;
	Элементы.Материалы_Таблица.ТолькоПросмотр =  Отказ;
	Элементы.Созданасборка.Видимость = не  Элементы.СоздатьСборки.Доступность;
	Элементы.ОстаткиМатериалов.Видимость = не Отказ;
	
	
	Изделие = Объект.ЗаказНаСборку.Номенклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаСборкуПриИзменении(Элемент)
	
	ЗаказНаСборкуПриИзмененииНаСервере();
	Если не Сборка.Пустая() тогда
		ПоказатьЗначение(,Сборка)
	КонецЕсли;
	
	ИзделиеПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	Элементы.Материалы_Таблица.ОтборСтрок = Неопределено;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчетЗначения = ложь;
	// begin fix Suetin
	//Если ЗначениеЗаполнено(объект.ЗаказНаСборку) тогда
	//	 ЗаказНаСборкуПриИзменении(Неопределено);
	//КонецЕсли;
	// end fix Suetin
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	ЗаполнитьДерево();
КонецПроцедуры


&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	
	
	ТС = Элементы.Материалы_Таблица.ТекущиеДанные;
	Если тс = Неопределено тогда Возврат КонецЕсли;;
	
	Если ТС.Норма + Тс.Дополнительно < ТС.Исключить тогда 
		ПоказатьПредупреждение(,"Количество  комплектующих в столбце ""Исключить""  
		|не может  превышать  сумму  количества  комплектующих  в  столбцах  ""Норма"" и ""Дополнительно"", 
		|уменьшите  количество до  значения, не превышающего названную сумму  в столбце Исключить!");
	КонецЕсли;
	
	ТС.Исключить = Мин(ТС.Норма + Тс.Дополнительно, ТС.Исключить);
	Тс.Количество =   ТС.Норма + Тс.Дополнительно - ТС.Исключить;
	
	//пересчитаем остатки с учетом изменений
	ПересчитатьОстатки();
	
	
КонецПроцедуры

&НаСервере
Функция  ВернутьИДВыделенной(СтрокиДерева,ИД)
	
	
	// пробежимся по всем Строкам (по всем Строкам одного уровня, которые были переданы!)
	Для каждого Строка из СтрокиДерева.ПолучитьЭлементы() Цикл
		
		// Вот наше условие, 
		Если " "+ СокрЛП( Строка.ИД) = " "+ СокрЛП(ИД) Тогда
			// Если условие сработало, возвращаем строку
			Возврат Строка.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	// Если не нашли строку, смотрим под-строки каждой строки
	Для каждого Строка из СтрокиДерева.ПолучитьЭлементы()  Цикл
		
		// Здесь осуществляется рекурсивный вызов
		НайденнаяСтрока = ВернутьИДВыделенной(Строка,ИД);
		Если НайденнаяСтрока <> неопределено Тогда
			// Если нашли, возвращается Строка
			Возврат НайденнаяСтрока;
		КонецЕсли;
		
	КонецЦикла;
	
	// Не нашли строку по условию, возвращаем неопределено
	Возврат неопределено;
	
КонецФункции


&НаКлиенте
Процедура МатериалыПриАктивизацииЯчейки(Элемент)
	
	//Элементы.Материалы_Таблица.ВыделенныеСтроки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//  Отказ = Истина;
	Если Копирование тогда
		отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ЗаполнениеДерева

&НаКлиенте
Процедура ЗаполнитьДерево()
	
	Если Изделие.Пустая() тогда Возврат; КонецЕсли;
	
	ЗаполнитьДеревоСервер();
	
	объект.Материалы.Сортировать("Номенклатура");
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоСервер()
	
	Объект.Материалы.Очистить();
	объект.Серии.Очистить();
	
	Если  объект.ЗаказНаСборку.Пустая() тогда возврат КонецЕсли;
	
	МатериалыКомплектации = РегистрыСведений.ИТБК_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	//МатериалыКомплектации = РегистрыСведений.vs_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	МатериалыКомплектации.Отбор.ЗаказНаСборку.Установить(Объект.ЗаказНаСборку);
	МатериалыКомплектации.Прочитать();
	
	ЕстьСохраненныеДанные = Ложь;
	
	Если МатериалыКомплектации.Количество() = 0 тогда    
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|   НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ НоменклатураАвтоИзготовления
		|ИЗ
		|   Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|   НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Автоизготовление_feccce2b4e25489e8cd74e9e3fdba306""
		|   И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|   СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
		|   ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК НоменклатураОсн,
		|   ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
		|   ВариантыКомплектацииНоменклатурыТовары.Номенклатура В
		|       (ВЫБРАТЬ
		|           т.Ссылка
		|       ИЗ
		|           номенклатураавтоизготовления КАК т) КАК Автоизготовление
		|ИЗ
		|   Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|   (ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной
		|               И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.ПометкаУдаления 
		|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|               И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец В
		|                       (ВЫБРАТЬ
		|                           т.Ссылка
		|                       ИЗ
		|                           номенклатураавтоизготовления КАК т)
		|           ИЛИ ВариантыКомплектацииНоменклатурыТовары.Ссылка = &ВариантКомплектации)
		|
		|СГРУППИРОВАТЬ ПО
		|   ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
		|   ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|   ВариантыКомплектацииНоменклатурыТовары.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|   Автоизготовление";
		Запрос.УстановитьПараметр("Изделие", Изделие);
		Запрос.УстановитьПараметр("ВариантКомплектации", объект.ЗаказНаСборку.ВариантКомплектации);
		Запрос.УстановитьПараметр("Владелец", объект.ЗаказНаСборку.ВариантКомплектации.Владелец);
		Комплектации = Запрос.Выполнить().Выгрузить();
		
	иначе
		Объект.Материалы.Загрузить(МатериалыКомплектации.Выгрузить());
		для Каждого стр из Объект.Материалы цикл
			стр.ИспользуютсяСерии = ИспользуютсяСерии(стр.Номенклатура)
		КонецЦикла;
		ЕстьСохраненныеДанные = Истина;
		
	КонецЕсли;
	
	ДобавитьСтрокиДереваРодителя(Комплектации,  Изделие,,объект.ЗаказНаСборку.Количество);
	
	
	Если МатериалыКомплектации.Количество() = 0 тогда    
		Мат = объект.Материалы.Выгрузить();
		Мат.Свернуть("Номенклатура,ИспользуютсяСерии","Норма,Дополнительно,Исключить,Количество,Доизготовление,Серия");
		объект.Материалы.Загрузить(Мат);
		//если это первое заполнение разделим серийные товары по 1
		РазделитьСерийныеТоварыПо1();
	КонецЕсли;
	
	ПересчитатьОстатки();
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьСтрокиДереваРодителя(Комплектации,  НоменклатураСборки,  Комплектация = Неопределено, Количество = 1)
	
	
	Если не ЕстьСохраненныеДанные тогда
		
		//если это не автосборка Если НоменклатураСборки.... тогда Возврат КонецЕсли;
		Если Комплектация = Неопределено тогда
			Комплектация = Комплектации.найтистроки(новый Структура("НоменклатураОсн",НоменклатураСборки));
		КонецЕсли;
		Порядок = 0;
		Для Каждого стр из Комплектация цикл
			мКомплектация = Комплектации.найтистроки(новый Структура("НоменклатураОсн",стр.Номенклатура));
			Если мКомплектация.количество() тогда 
				//если есть комплектация, то добавим в дерево и заполним материалы для нее в рекурсии
				ДобавитьСтрокиДерева(Комплектации,  стр.Номенклатура, мКомплектация, стр.Количество, Количество);
			иначе
				//иначе это материал
				
				СтрМатериалы = объект.Материалы.Добавить();
				СтрМатериалы.Номенклатура = стр.Номенклатура;
				СтрМатериалы.Норма = стр.Количество * Количество / стр.ссылка.Количество;
				СтрМатериалы.Количество = стр.Количество * Количество / стр.ссылка.Количество;
				СтрМатериалы.ИспользуютсяСерии = ИспользуютсяСерии(СтрМатериалы.Номенклатура)
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиДерева(Комплектации,  НоменклатураСборки,  Комплектация = Неопределено, Количество = 1, КолРодителя)
	
	
	Если не ЕстьСохраненныеДанные тогда
		
		//если это не автосборка Если НоменклатураСборки.... тогда Возврат КонецЕсли;
		Если Комплектация = Неопределено тогда
			Комплектация = Комплектации.найтистроки(новый Структура("НоменклатураОсн",НоменклатураСборки));
		КонецЕсли;
		Порядок = 0;
		Для Каждого стр из Комплектация цикл
			мКомплектация = Комплектации.найтистроки(новый Структура("НоменклатураОсн",стр.Номенклатура));
			Если мКомплектация.количество() тогда 
				//если есть комплектация, то добавим в дерево и заполним материалы для нее в рекурсии
				ДобавитьСтрокиДерева(Комплектации,  стр.Номенклатура, мКомплектация, стр.Количество*Количество,КолРодителя);
			иначе
				//иначе это материал
				СтрМатериалы = объект.Материалы.Добавить();
				СтрМатериалы.Номенклатура = стр.Номенклатура;
				СтрМатериалы.Норма = (стр.Количество * Количество / стр.ссылка.Количество)*КолРодителя;
				СтрМатериалы.Количество = (стр.Количество * Количество / стр.ссылка.Количество)*КолРодителя;
				СтрМатериалы.ИспользуютсяСерии = ИспользуютсяСерии(СтрМатериалы.Номенклатура)
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура РазделитьСерийныеТоварыПо1()
	
	материалы = объект.Материалы.Выгрузить();
	объект.Материалы.Очистить();
	для  Каждого стр из  материалы цикл
		НовСтр = объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,стр);
		Если ИспользуютсяСерии(стр.Номенклатура) тогда
			Количество = НовСтр.Количество;
			НовСтр.Норма = 1;   
			НовСтр.Количество = 1;
			
			для м = 1 по Количество-1 Цикл 
				ЗаполнитьЗначенияСвойств(объект.Материалы.Добавить(),НовСтр);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры




#КонецОбласти


#Область Оформление

&НаСервере
Функция ПересчитатьОстатки() Экспорт
	
	Если Элементы.Материалы_Таблица.ТолькоПросмотр тогда возврат Неопределено КонецЕсли;
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	9999999 КАК Порядок,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстатокСвободный
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Номенклатура В (&Номенклатура)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Материалы.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склад", Объект.ЗаказНаСборку.Склад);
	Запрос.УстановитьПараметр("Дата", ?(ПересчетЗначения,Объект.ДатаСборки,ТекущаяДата()));
	
	Остатки.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	|ВЫБРАТЬ
	|	Т.Номенклатура 		КАК Номенклатура,
	|	Т.ВНаличииОстаток 	КАК ВНаличииОстаток,
	|	АУН.Ссылка			КАК КлючАналитики
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Номенклатура В (&Номенклатура)
	|				И Склад = &Склад) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АУН
	|			ПО Т.Номенклатура = АУН.Номенклатура  
	|			И Т.Характеристика = АУН.Характеристика   
	|			И Т.Серия = АУН.Серия 
	|			И Т.Назначение = АУН.Назначение 
	|			И Т.Склад = АУН.СкладскаяТерритория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	//|	вт.ВНаличииОстаток КАК ВНаличииОстаток,
	//|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстатокСвободный,
	//|	вт.ВНаличииОстаток - СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВРезерве
	//|ИЗ
	//|	РегистрНакопления.СвободныеОстатки.Остатки(
	//|			&Дата,
	//|			Номенклатура В (&Номенклатура)
	//|				И Склад = &Склад) КАК СвободныеОстаткиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	//|		ПО СвободныеОстаткиОстатки.Номенклатура = вт.Номенклатура" ;
	|ВЫБРАТЬ
	|	вт.Номенклатура 								КАК Номенклатура,
	|	ЕСТЬNULL(СУММА(вт.ВНаличииОстаток),0) 			КАК ВНаличииОстаток,
	|	ЕСТЬNULL(СУММА(вт.ВНаличииОстаток),0) 
	|		- ЕСТЬNULL(СУММА(РТ.КоличествоОстаток),0) 	КАК ВНаличииОстатокСвободный,
	|	ЕСТЬNULL(СУММА(РТ.КоличествоОстаток),0) 		КАК ВРезерве
	|ИЗ
	|	 вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
	|			&Дата,) КАК РТ
	|		ПО вт.КлючАналитики = РТ.АналитикаУчетаНоменклатуры
	|СГРУППИРОВАТЬ ПО вт.Номенклатура
	|
	|";
	Запрос.УстановитьПараметр("Номенклатура", Объект.Материалы.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склад", Объект.ЗаказНаСборку.Склад);
	Запрос.УстановитьПараметр("Дата", ?(ПересчетЗначения,Объект.ДатаСборки,ТекущаяДата()));
	ОстаткиСвободные = Запрос.Выполнить().Выгрузить();
	
	//заполняем обычными остатками на складах 
	Для Каждого СтрМатериалы из объект.Материалы цикл
		// остаток по данной серии
		Остаток = Остатки.НайтиСтроки(новый Структура("Номенклатура,Серия",СтрМатериалы.Номенклатура,СтрМатериалы.Серия));
		Если не Остаток.Количество() = 0 тогда
			//поставим приоритет списания больше тем, , кто есть в 	таблице материалов
			СтрМатериалы.НаСкладеВсего = Остаток[0].ВНаличииОстаток;
			Остаток[0].Порядок = СтрМатериалы.НомерСтроки;
		КонецЕсли;
		
		//РЕЗЕРВ БЕЗ УЧЕТА СЕРИЙ 
		Резерв = ОстаткиСвободные.НайтиСтроки(новый Структура("Номенклатура",СтрМатериалы.Номенклатура));
		Если не Резерв.Количество() = 0 тогда
			СтрМатериалы.ВРезерве = Резерв[0].ВРезерве
		КонецЕсли;
		
	КонецЦикла;    
	
	Остатки.Сортировать("Номенклатура,Порядок");
	
	
	// распределим свободный остаток по остаткам с сериями.
	// в первую очередь уйдут как раз серии с меньшим порядком( те что есть в материалах)
	Для Каждого СтрМатериалы из ОстаткиСвободные цикл
		//ищем строки остатка
		Остаток = Остатки.НайтиСтроки(новый Структура("Номенклатура",СтрМатериалы.Номенклатура));
		Всего = 0;
		//в цикле смотрим сколько всего остатка и когда он превысит максимально возможное ( свободный остаток ) 
		//оставим только то, что можно оставить 
		Для Каждого мОстаток из Остаток цикл
			Всего = Всего + мОстаток.ВНаличииОстатокСвободный;
			Если  всего > СтрМатериалы.ВНаличииОстатокСвободный тогда
				мОстаток.ВНаличииОстатокСвободный = мОстаток.ВНаличииОстатокСвободный - (всего - СтрМатериалы.ВНаличииОстатокСвободный);
			КонецЕсли;
		КонецЦикла; 		
		Остаток = объект.Материалы.НайтиСтроки(новый Структура("Номенклатура",СтрМатериалы.Номенклатура));
		Для Каждого мОстаток из Остаток цикл
			мОстаток.НаСкладеБезСерий = СтрМатериалы.ВНаличииОстаток;
		КонецЦикла; 		
		
	КонецЦикла;    
	//
	//
	
	
	//пойдем по материалам и распредеим остатки. если чего-то не хватает - раскрасим строку дерева родителя
	Для Каждого СтрМатериалы из объект.Материалы цикл
		
		СтрМатериалы.НаСкладе = 0 ;
		Остаток = Остатки.НайтиСтроки(новый Структура("Номенклатура,Серия",СтрМатериалы.Номенклатура,СтрМатериалы.Серия));
		
		Если Остаток.Количество() = 0  и СтрМатериалы.Количество <> 0 тогда
			
			Отказ = Истина;
			Продолжить;
			
		ИначеЕсли не Остаток.Количество() = 0 и Остаток[0].ВНаличииОстатокСвободный < СтрМатериалы.Количество тогда 
			
			Отказ = Истина;
			
		ИначеЕсли Остаток.Количество() = 0 тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ВНаличии = ?(Остаток[0].ВНаличииОстатокСвободный - СтрМатериалы.Количество < 0 , Остаток[0].ВНаличииОстатокСвободный , СтрМатериалы.Количество) ;
		СтрМатериалы.НаСкладе = ?(Остаток[0].ВНаличииОстатокСвободный < 0, 0, ВНаличии); 
		
		//уменьшим остаток для дальнейшего распределения
		Остаток[0].ВНаличииОстаток = Остаток[0].ВНаличииОстаток - СтрМатериалы.Количество;
		Остаток[0].ВНаличииОстатокСвободный = Остаток[0].ВНаличииОстатокСвободный - СтрМатериалы.Количество;
		
	КонецЦикла;
	
	
	//для разработки и просмотра на форме остатка после распределения
	
	СохранитьДанные();
	
	//всг+(
	Если НЕ Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить() Тогда
		Отказ = ЛОЖЬ;
	КонецЕсли;
	//всг)
	
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура СохранитьДанные()
	
	Набор = РегистрыСведений.ИТБК_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаказНаСборку.Установить(Объект.ЗаказНаСборку);
	набор.Очистить();
	для Каждого СтрокаНабора из объект.Материалы цикл
		НСТР = НАБОР.Добавить();
		ЗаполнитьЗначенияСвойств(НСТР,СтрокаНабора);
		НСТР.НомерСтроки_ = СтрокаНабора.НомерСтроки;
	КонецЦикла;  
	для Каждого СтрокаНабора из Набор цикл
		СтрокаНабора.ЗаказНаСборку      = объект.ЗаказНаСборку;
	КонецЦикла;
	Набор.Записать();
	
	Набор = РегистрыСведений.vs_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаказНаСборку.Установить(Объект.ЗаказНаСборку);
	набор.Очистить();
	для Каждого СтрокаНабора из объект.Материалы цикл
		НСТР = НАБОР.Добавить();
		ЗаполнитьЗначенияСвойств(НСТР,СтрокаНабора);
		НСТР.НомерСтроки_ = СтрокаНабора.НомерСтроки;
	КонецЦикла;  
	для Каждого СтрокаНабора из Набор цикл
		СтрокаНабора.ЗаказНаСборку      = объект.ЗаказНаСборку;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти


#Область СозданиеДокументов

&НаКлиенте
Процедура СоздатьСборки(Команда)
	
	Отказ = ПересчитатьОстатки();
	Если  Объект.Материалы.Итог("количество") = 0 тогда
		
		ПоказатьПредупреждение(,"Изготовление данного Заказа и проведение документа Сборка невозможны, так как количество комплектующих  всех строк равно нулю ");
		
	ИначеЕсли не Отказ тогда
		
		Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
			ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Изделие,"ВидНоменклатуры")
			,"ИспользоватьСерии")  тогда
			Если не объект.Серии.Количество() тогда
				для м = 1 по   ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
					объект.ЗаказНаСборку,"Количество") цикл
					объект.Серии.Добавить();
				КонецЦикла;
			КонецЕсли;
			Форма = ОткрытьФорму("Обработка.Автоизготовление.Форма.СозданиеСерий",,ЭтаФорма,,,,новый ОписаниеОповещения("СоздатьСборкиЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			//Форма = ОткрытьФорму("ВнешняяОбработка.Автоизготовление.Форма.ФормаРедактированияОстатков",новый Структура("Родитель,ключ", Родитель.ИД,объект),ЭтаФорма);
			КопироватьДанныеФормы(Объект,Форма.Объект);
		иначе          
			
			СоздатьДокументыРекурсивно();
			ЗаказНаСборкуПриИзменении(Неопределено);
			
		КонецЕсли;
		
	Иначе 
		
		ПоказатьПредупреждение(,"не хватает остатков ");
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьСборкиЗавершение(Ответ,ДП) Экспорт
	
	если Ответ  = "Ок"  тогда
		СоздатьДокументыРекурсивно();
		ЗаказНаСборкуПриИзменении(Неопределено);
	КонецЕсли;
	
	
КонецПроцедуры

&Насервере
Процедура СоздатьДокументыРекурсивно()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.СоздатьСборки() ;
	
КонецПроцедуры


&НаКлиенте
Процедура Материалы_ТаблицаПриАктивизацииСтроки(Элемент)
	
	ТС =  Элементы.Материалы_Таблица.ТекущиеДанные ;
	Если тс = Неопределено тогда Возврат КонецЕсли;;
	Элементы.МатериалыНоменклатура.ТолькоПросмотр = Тс.Норма <> 0;
	Элементы.Материалы_ТаблицаСерия.ТолькоПросмотр = не (Тс.ИспользуютсяСерии);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТС =  Элементы.Материалы_Таблица.ТекущиеДанные ;
	Если тс = Неопределено тогда Возврат КонецЕсли;;
	
	
	ТС.ИспользуютсяСерии = ИспользуютсяСерии(ТС.Номенклатура) ;
	
	
КонецПроцедуры

&Насервере
Функция  ИспользуютсяСерии(Номенклатура)
	
	возврат Номенклатура.ВидНоменклатуры.ИспользоватьСерии;
	
КонецФункции

&НаКлиенте
Процедура Материалы_ТаблицаПередУдалением(Элемент, Отказ)
	
	ТС =  Элементы.Материалы_Таблица.ТекущиеДанные ;
	Если тс = Неопределено тогда Возврат КонецЕсли;;
	
	отказ  = Тс.Норма <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура Материалы_ТаблицаСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.Автоизготовление.Форма.выборСерии",новый Структура("Ном",Элементы.Материалы_Таблица.ТекущиеДанные.Номенклатура),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Материалы_ТаблицаСерияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Текст = "";
	Материалы_ТаблицаСерияНачалоВыбора(Элемент,Неопределено,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Материалы_ТаблицаСерияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Текст = "";
КонецПроцедуры

&НаКлиенте
Процедура Материалы_ТаблицаСерияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Текст = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Параметры.Свойство("ПараметрКоманды",объект.ЗаказНаСборку) тогда
		Если  объект.ЗаказНаСборку.Статус <> Перечисления.СтатусыВнутреннихЗаказов.КВыполнению или не объект.ЗаказНаСборку.Проведен тогда
			отказ = Истина;
			Сообщить("Изготовление выполняется только на проведенные заказы в статусе "" к выполнению """);
		КонецЕсли;
	КонецЕсли;
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","Автоизготовление_feccce2b4e25489e8cd74e9e3fdba306");
	Значение = объект.ЗаказНаСборку.Номенклатура.ДополнительныеРеквизиты.Найти(Свойство);
	Если Значение <>  Неопределено 
		и Значение.Значение = Истина тогда
		отказ = Истина;
		Сообщить("Номенклатура является автоизготавливаемой, изготовление невозможно");
		Возврат;
	КонецЕсли;
	

	НовыйМассивПараметр = Новый Массив();
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", НовыеЗначения);
	
	НовыйМассивПараметр.Добавить(НовыйПараметр);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Истина);
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Проведен", НовыеЗначения);
	
	НовыйМассивПараметр.Добавить(НовыйПараметр);
	// begin fix Designer17.02.2022 10:24:55
	//Объект.ДатаСборки = Объект.ЗаказНаСборку.ОкончаниеСборкиРазборки;
	//
	//ПересчетЗначения = Ложь;    
	ПересчетЗначения = Истина;
	Объект.ДатаСборки = КонецДня(Объект.ЗаказНаСборку.НачалоСборкиРазборки);
	Если ЗначениеЗаполнено(Объект.ЗаказНаСборку) Тогда
		ЗаказНаСборкуПриИзмененииНаСервере();
		Если Не Изделие.Пустая() Тогда 
			ЗаполнитьДеревоСервер();
			Объект.Материалы.Сортировать("Номенклатура");
			ПересчетЗначения = Истина;
			ПересчитатьОстатки();
		КонецЕсли;
	КонецЕсли;
	// end fix Designer17.02.2022 10:24:49
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассивПараметр);
	Элементы.ЗаказНаСборку.ПараметрыВыбора = НовыеПараметры;
	
	 УстановитьУсловноеОформление();
	
	
 КонецПроцедуры
 
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Материалы_ТаблицаГруппа3");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Номенклатура.ВидНоменклатуры.ИспользоватьСерии");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

КонецПроцедуры
&НаКлиенте
Процедура ПересчитатьОстатки1(Команда)
	ПересчетЗначения = Истина;
	ПересчитатьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ДатаСборки = ТекущаяДата();
КонецПроцедуры

#КонецОбласти
